Задание 2.
Ниже список тестовых сценариев.
Ваша задача - определить тип каждого теста (юнит-тест, интеграционный тест, сквозной тест) и объяснить,
почему вы так решили.

1) Проверка того, что функция addContact корректно добавляет новый контакт в список контактов.

Здесь нужен юнит-тест.
Т.к. это небольшой фрагмент кода, в одном классе.
Нет внешних зависимостей и нет взаимодействия между другими классами.


2) Проверка того, что при добавлении контакта через пользовательский интерфейс,
контакт корректно отображается в списке контактов.

Здесь нужен интеграционный тест.
Т.к. идет обмен данными между различными частями приложения.



3) Проверка полного цикла работы с контактом: создание контакта, его редактирование и последующее удаление.

Здесь нужен сквозной тест, т.к. идет проверка полного цикла работы.
Есть взаимодействие между модулями. И скорее всего присутствует пользовательский интерфейс.